Ran Plan for dir: `atlantis` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.github_ip_ranges.waf: Reading...
data.github_ip_ranges.waf: Read complete after 1s [id=github-ip-ranges]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_default_route_table.example will be created
+ resource "aws_default_route_table" "example" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (10 unchanged attributes hidden)
            },
        ]
      + tags                   = {
          + "name" = "atlantis-VPC-RT"
        }
      + tags_all               = {
          + "name" = "atlantis-VPC-RT"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_internet_gateway.atlantis will be created
+ resource "aws_internet_gateway" "atlantis" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "name" = "atlantis-IGW"
        }
      + tags_all = {
          + "name" = "atlantis-IGW"
        }
      + vpc_id   = (known after apply)
    }

  # aws_security_group.atlantis will be created
+ resource "aws_security_group" "atlantis" {
      + arn                    = (known after apply)
      + description            = "Allow TLS inbound traffic and all outbound traffic "
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "atlantis-SG"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "name" = "atlantis-SG"
        }
      + tags_all               = {
          + "name" = "atlantis-SG"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.first will be created
+ resource "aws_subnet" "first" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "name" = "atlantis-sb-first"
        }
      + tags_all                                       = {
          + "name" = "atlantis-sb-first"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.second will be created
+ resource "aws_subnet" "second" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "name" = "atlantis-sb-second"
        }
      + tags_all                                       = {
          + "name" = "atlantis-sb-second"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.third will be created
+ resource "aws_subnet" "third" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "name" = "atlantis-sb-third"
        }
      + tags_all                                       = {
          + "name" = "atlantis-sb-third"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.atlantis will be created
+ resource "aws_vpc" "atlantis" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "name" = "atlantis-VPC"
        }
      + tags_all                             = {
          + "name" = "atlantis-VPC"
        }
    }

  # aws_vpc_security_group_egress_rule.allow_all will be created
+ resource "aws_vpc_security_group_egress_rule" "allow_all" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = -1
    }

  # aws_vpc_security_group_ingress_rule.allow_SG will be created
+ resource "aws_vpc_security_group_ingress_rule" "allow_SG" {
      + arn                          = (known after apply)
      + from_port                    = -1
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
      + to_port                      = -1
    }

  # aws_vpc_security_group_ingress_rule.allow_http_ipv4 will be created
+ resource "aws_vpc_security_group_ingress_rule" "allow_http_ipv4" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "199.126.147.173/32"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 80
    }

  # aws_vpc_security_group_ingress_rule.github_webhook_ingress["140.82.112.0/20"] will be created
+ resource "aws_vpc_security_group_ingress_rule" "github_webhook_ingress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "140.82.112.0/20"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = -1
    }

  # aws_vpc_security_group_ingress_rule.github_webhook_ingress["143.55.64.0/20"] will be created
+ resource "aws_vpc_security_group_ingress_rule" "github_webhook_ingress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "143.55.64.0/20"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = -1
    }

  # aws_vpc_security_group_ingress_rule.github_webhook_ingress["185.199.108.0/22"] will be created
+ resource "aws_vpc_security_group_ingress_rule" "github_webhook_ingress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "185.199.108.0/22"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = -1
    }

  # aws_vpc_security_group_ingress_rule.github_webhook_ingress["192.30.252.0/22"] will be created
+ resource "aws_vpc_security_group_ingress_rule" "github_webhook_ingress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "192.30.252.0/22"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = -1
    }

  # aws_vpc_security_group_ingress_rule.github_webhook_ingress["2606:50c0::/32"] will be created
+ resource "aws_vpc_security_group_ingress_rule" "github_webhook_ingress" {
      + arn                    = (known after apply)
      + cidr_ipv6              = "2606:50c0::/32"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = -1
    }

  # aws_vpc_security_group_ingress_rule.github_webhook_ingress["2a0a:a440::/29"] will be created
+ resource "aws_vpc_security_group_ingress_rule" "github_webhook_ingress" {
      + arn                    = (known after apply)
      + cidr_ipv6              = "2a0a:a440::/29"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = -1
    }

Plan: 16 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d atlantis
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://ip-172-31-25-238.ec2.internal:4141/lock?id=TapanPatel11%252Fterraform%252Fatlantis%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d atlantis
  ```
Plan: 16 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```